Revit 2024 API
ScheduleFilter.SetValue Method (Int32)
 Set the filter value to an integer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetValue(
	int value
)
Visual Basic
Public Sub SetValue ( _
	value As Integer _
)
Visual C++
public:
void SetValue(
	int value
)
Parameters
value
Type: System.Int32
 The filter value.
See Also
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace